
// Необходимо реализовать автодополнение. При введении в инпут первых букв страны - появляется список стран, которые начинаются на те буквы, которые вы ввели. Чем больше букв вы вводите - тем меньше стран в списке. Страну можно выбрать, кликнув по ней мышкой - в этом случае ее название появится в инпуте.
// Массив со списком стран я уже сделал.

let countries = ["Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Андорра", "Антигуа и Барбуда", "Антильские острова", 
				"Аргентина", "Армения", "Афганистан", "Багамские острова", "Бангладеш", "Барбадос", "Бахрейн", "Белиз", "Белоруссия", "Бельгия", "Бенин", 
				"Болгария", "Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Буркина-Фасо", "Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", 
				"Венгрия", "Венесуэла", "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Голландия", 
				"Гондурас", "Гонконг", "Гренада", "Гренландия", "Греция", "Грузия", "Гуам", "Дания", "Демократическая Республика Конго", "Джибути", 
				"Доминиканская республика", "Египет", "Замбия", "Западная Сахара", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", 
				"Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", 
				"Кипр", "Киргизия", "Кирибати", "Китай", "КНДР", "Колумбия", "Коморские острова", "Коста-Рика", "Кот-д'Ивуар", "Куба", "Кувейт", "Лаос", 
				"Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Македония", 
				"Малави", "Малайзия", "Мали", "Мальдивы", "Мальта", "Марокко", "Мартиника", "Мексика", "Микронезия", "Мозамбик", "Молдавия", "Монако", 
				"Монголия", "Мьянма", "Намибия", "Непал", "Нигер", "Нигерия", "Никарагуа", "Новая Зеландия", "Новая Каледония", "Норвегия", "ОАЭ", "Оман", 
				"Пакистан", "Палестина", "Панама", "Папуа-Новая Гвинея", "Парагвай", "Перу", "Польша", "Португалия", "Пуэрто-Рико", "Республика Конго", 
				"Республика Корея", "Россия", "Руанда", "Румыния", "Сальвадор", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", 
				"Сенегал", "Сент-Китс и Невис", "Сент-Люсия", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соломоновы острова", "Сомали", "Судан", 
				"Суринам", "США", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", "Танзания", "Того", "Тонга", "Тринидад и Тобаго", "Тунис", 
				"Туркменистан", "Турция", "Уганда", "Узбекистан", "Украина", "Уругвай", "Фиджи", "Филиппины", "Финляндия", "Франция", "Французская Гвиана", 
				"Хорватия", "Центральноафриканская Республика", "Чад", "Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", 
				"Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Ямайка", "Япония"];

let input = document.getElementById('country'),
	list = document.getElementById('list');
	
	//создаем новый элемент список для вывода найденных стран
	ul=document.createElement('ul');
	list.appendChild(ul);
	
	//Определяем переменные для сохранения индекса первого и последнего элемента массива,
	//удволетворяющего введенной строке
	let startPos = endPos =0;
 
//Добавляем обработчик события для поля ввода
input.addEventListener('input', function(event) {
	
  //перед отображением найденных стран очищаем список 	
  clearList(ul);
    
  let isFindFirst = false; //По умолчанию ни одной страны не найдено
  if (!event.target.value) {//Если поле ввода не заполненно, 
    startPos = endPos= 0 ; //сбрасывем на ноль переменные хранящие первый и последний индекс
  }
  let reg = new RegExp('^'+event.target.value, 'i'); //Создаем рег. выражения для поиска с начала строки,
													 //без учета регистра		
  for(let i = startPos ; i<countries.length; i++) { //В цикле перебираем все элементы массива стран
   
   if (reg.test(countries[i])) { //Если элемент массива начинается с введенной строки
   	  if (!isFindFirst) {		 //Говорим, что первый элемент найден и запоминаем позицию
   	    isFindFirst = true;
   	    startPos=i	
   	  }

   	if (!reg.test(countries[i+1])) { //Если следующий элемент не содержит ввведной строки,
   		endPos=i;					//запоминаем индекс последнего элемента удволетворяющего поиску
   		break;						//выходим из цикла					
   	}
   }
  }

let x=startPos; //техническая переменная для перебора массива. Присваиваем ей значение первого найденного
				//индекса
 
//Пока не последний найденный элемент массива 
//и он содержит введенную строку
//и поле ввода не пустое 
while (x<=endPos && reg.test(countries[x]) && event.target.value) {	   	
   	let li=document.createElement('li'); //создаем новый элемент списка
   	li.innerHTML = countries[x]; //вставляем в него название страны
   	ul.appendChild(li); // и добавлем его в список
   	x++;
}	
});

//добавлем обработчик события на список
ul.addEventListener('click', function(event) {
	let targer = event.target;

	if (targer.tagName=='LI') { //Если щелкнули по элементу списка,
		input.value=targer.innerHTML; //то вставляем в поле ввода его       содержимое
    clearList(ul);
	}
});

//функция очитски списка
function clearList(elem) {
//пока у элемента есть дети	
  while (elem.hasChildNodes()) {
//удаляем их	  
     elem.removeChild(elem.lastChild);
  }
}


input.onkeydown = function() {
    var key = event.keyCode || event.charCode;
	if (key == 8 && event.target.value) {
	 startPos = 0;
	}	    
};
